@echo off
echo ==============================
echo 进入当前脚本所在目录 %~dp0
cd /D %~dp0
echo ==============================
echo 刷新当前Path环境变量开始
echo ==============================
echo 输出系统注册表中的环境变量
setenv.exe -g Path
echo ==============================
echo 输出当前cmd中的环境变量
echo %Path%
echo ==============================
echo 临时将环境变量值设置为1
set Path=1
echo ==============================
echo 输出当前cmd中的环境变量
echo %Path%
echo ==============================
echo 注意: 环境变量刷新已完成，请结束时关闭当前命令行窗口重新打开
echo 注意: 存在cmd中测试成功，但cmder中的环境变量未更新成功的可能，重启解决
echo ==============================
echo === 请按任意键退出! 
pause
